Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: A: If you are very sure that your packages don't break anything, that the version is sane (i.e. greater than the version in stable and less than the version in testing/unstable), that you didn't change the behaviour of the package, despite the corresponding security problem, that you compiled it for the correct distribution (that is oldstable-security or stable-security), that the package contains the original source if the package is new on security.debian.org, that you can confirm the patch against the most recent version is clean and only touches the corresponding security problem (check with interdiff -z and both .diff.gz files), that you have proofread the patch at least thrice, and that debdiff doesn't display any changes, you may upload the files into the incoming directory ftp://ftp.security.upload.debian.org/pub/SecurityUploadQueue on the security.debian.org directly. Please send a notification with all details and links to team@security.debian.org as well.
pt_pt: R: Se você tem absoluta certeza que seus pacotes não quebrarão alguma coisa; que a versão está correta (exemplo: maior do que a versão na estável (stable) e menor do que a versão na teste/instável (testing/unstable)); que você não alterou o comportamento do pacote apesar do problema de segurança em questão; que você o compilou para a versão correta (que é a oldstable-security ou stable-security); que o pacote contém o código-fonte original se for novo no security.debian.org; que você pode confirmar que a correção (patch) da versão mais recente está correta e somente a parte relacionada com o problema de segurança em questão foi modificada (verifique com interdiff -z e ambos arquivos .diff.gz); que você tenha revisado a correção (patch) pelo menos três vezes; e que o debdiff não tenha mostrado nenhuma mudança, você pode enviar os arquivos diretamente para o repositório de entrada (incoming) ftp://ftp.security.upload.debian.org/pub/SecurityUploadQueue em security.debian.org. Por favor, envie também uma notificação com todos os detalhes e links para o e-mail team@security.debian.org.

source: Q: How can I help with security?
pt_pt: Q: Como posso ajudar com a segurança?

source: A: Please review each problem before reporting it to security@debian.org. If you are able to provide patches, that would speed up the process. Do not simply forward bugtraq mails, because we already receive them — but do provide us with additional information about things reported on bugtraq.
pt_pt: R: Por favor, reveja cada problema antes de informá-lo ao security@debian.org. Se você for capaz de fornecer correções (patches), isto aumentará a velocidade do processo. Não encaminhe simplesmente e-mails do bugtraq, porque nós já os recebemos — mas nos forneça informações adicionais sobre o que foi relatado no bugtraq.

source: A good way to get started with security work is helping out on the Debian Security Tracker (instructions).
pt_pt: Uma boa forma de começar no trabalho de segurança é ajudando com o rastreador de segurança Debian (Debian Security Tracker) (instruções).

source: Q: What is the scope of proposed-updates?
pt_pt: Q: Qual é o escopo do proposed-updates?

source: A: This directory contains packages which are proposed to enter the next revision of Debian stable. Whenever packages are uploaded by a maintainer for the stable distribution, they end up in the proposed-updates directory. Since stable is meant to be stable, no automatic updates are made. The security team will upload fixed packages mentioned in their advisories to stable, however they will be placed in proposed-updates first. Every couple of months the Stable Release Manager checks the list of packages in proposed-updates and discusses whether a package is suited for stable or not. This is compiled into another revision of stable (e.g. 2.2r3 or 2.2r4). Packages that don't fit will probably be rejected and dropped from proposed-updates as well.
pt_pt: R: Este repositório contém pacotes que são sugeridos para entrar na próxima versão estável (stable) do Debian. Sempre que pacotes são enviados por um(a) mantenedor(a) para a versão estável, eles acabam no diretório proposed-updates. Já que a estável é feita para ser estável, não são realizadas atualizações automáticas. O Time de Segurança enviará pacotes corrigidos, mencionados em alertas, para a estável, no entanto eles serão colocados antes no proposed-updates. A cada dois meses, o(a) gerente da versão estável confere a lista de pacotes do proposed-updates e discute se um pacote serve ou não para a estável. Os escolhidos são compilados em uma nova versão da estável (por exemplo, 2.2r3 ou 2.2r4). Pacotes que não se encaixam na versão estável provavelmente serão rejeitados e também retirados do proposed-updates.

source: Note that the packages uploaded by maintainers (not by the security team) in the proposed-updates/ directory are not supported by the security team.
pt_pt: Note que pacotes com uploads feitos por mantenedores(as) (não pelo Time de Segurança) no diretório proposed-updates/ não são suportados pelo Time de Segurança.

source: Q: How is the security team composed?
pt_pt: Q: Como o Time de Segurança é composto?

source: A: The Debian security team consists of several officers and secretaries. The security team itself appoints people to join the team.
pt_pt: R: O Time de Segurança do Debian consiste em alguns(as) oficiais e secretários(as). O próprio Time de Segurança designa pessoas para se juntar ao grupo.

source: Q: How long will security updates be provided?
pt_pt: Q: Por quanto tempo as atualizações de segurança são fornecidas?

source: A: The security team will support a stable distribution for three years after its release. It is not possible to support three distributions; supporting two simultaneously is already difficult enough.
pt_pt: R: A equipe de segurança dará suporte a uma versão estável (stable) por três ano após o seu lançamento. Não é possível dar suporte a três versões; dar suporte a duas simultaneamente já é difícil o bastante.

source: Q: How can I check the integrity of packages?
pt_pt: Q: Como verifico a integridade de um pacote?

source: A: This process involve checking the Release file signature against the public key used for the archive. The Release file contains the checksums of Packages and Sources files, which contain checksums of binary and source packages. Detailed instruction on how to check packages integrity can be found in the Debian Securing Manual.
pt_pt: R: É preciso verificar a assinatura do arquivo Release contra a chave pública usada no repositório. O arquivo Release contém os checksums dos arquivos Packages e Sources, e estes contêm os checksums dos pacotes binários e fontes. Mais informações de como verificar a integridade dos pacotes podem ser encontradas no manual de segurança do Debian.

source: Q: What to do if a random package breaks after a security update?
pt_pt: Q: O que fazer quando um pacote aleatório quebra após uma atualização de segurança?

source: A: First of all, you should figure out why the package breaks and how it is connected to the security update, then contact the security team if it is serious or the stable release manager if it is less serious. We're talking about random packages that break after a security update of a different package. If you can't figure out what's going wrong but have a correction, talk to the security team as well. You may be redirected to the stable release manager though.
pt_pt: R: Antes de mais nada, você deve descobrir por que o pacote quebrou e como isto está conectado à atualização de segurança, então contate o Time de Segurança se isto for sério ou o(a) gerente da versão estável (stable) se for menos sério. Nós estamos falando de pacotes aleatórios que quebram após uma atualização de segurança de um pacote diferente. Se você não consegue descobrir o que está dando errado, mas tem uma correção, fale com o Time de Segurança também. É possível que você seja redirecionado ao(à) gerente da verão estável.

source: Q: What is a CVE identifier?
pt_pt: Q: O que é um identificador CVE?

source: A: The Common Vulnerabilities and Exposures project assignes unique names, called CVE identifiers, to specific security vulnerabilities, to make it easier to uniquely refer to a specific issue. More information can be found at Wikipedia.
pt_pt: R: O projeto Common Vulnerabilities and Exposures (Vulnerabilidades e Exposições Comuns) determina nomes exclusivos, chamados identificadores CVE, para especificar vulnerabilidades de segurança, de modo que seja mais fácil fazer referências a um determinado problema. Mais informações podem ser encontradas na Wikipedia.

source: Q: Does Debian issue a DSA for every CVE id?
pt_pt: Q: O Debian lança um DSA para cada identificador CVE?

source: A: The Debian security team keeps track of every issued CVE identifier, connect it to the relevant Debian package and assess its impact in a Debian context - the fact that something is assigned a CVE id does not necessarily imply that the issue is a serious threat to a Debian system. This information is tracked in the Debian Security Tracker and for the issues that are considered serious a Debian Security Advisory will be issued.
pt_pt: R: O Time de Segurança do Debian acompanha cada identificador CVE lançado, o conecta a cada pacote Debian relevante e avalia seu impacto no contexto do Debian - o fato de que algo foi identificado como CVE não implica necessariamente que é uma ameaça séria para o sistema Debian. Esta informação é monitorada no Debian Security Tracker (Rastreador de Segurança Debian) e, para casos que são considerados sérios, será lançado um Alerta de Segurança Debian.

source: Low-impact issues not qualifying for a DSA can be fixed in the next release of Debian, in a point release of the current stable or oldstable distributions, or are included in a DSA when that is being issued for a more serious vulnerability.
pt_pt: Casos de baixo impacto que não se qualificam como DSA podem ser corrigidos na próxima versão do Debian, em uma versão pontual das atuais distribuições estável (stable) ou antiga (oldstable), ou incluídos num DSA quando referirem-se à vulnerabilidades mais sérias.

source: Q: Can Debian assign CVE identifiers?
pt_pt: Q: O Debian pode definir identificadores CVE?

source: A: Debian is a CVE Numbering Authority and can assign ids, but per CVE policy only to yet-undisclosed issues. If you have an undisclosed security vulnerability for software in Debian and would like to get an identifier for it, contact the Debian Security Team. For cases where the vulnerability is already public, we advise to follow the procedure detailed in the CVE OpenSource Request HOWTO.
pt_pt: R: O Debian é uma CVE Numbering Authority (Autoridade de Numeração CVE) e pode definir identificadores, mas seguindo a política CVE, somente para casos ainda desconhecidos. Se você possui uma vulnerabilidade de segurança desconhecida para softwares do Debian e gostaria de definir um identificador para ela, contate o Time de Segurança. Para casos em que a vulnerabilidade já é pública, sugerimos que você siga o procedimento detalhado no documento como fazer uma requisição de CVE para código aberto (CVE OpenSource Request).

source: Q: Does Debian have a vulnerability disclosure policy?
pt_pt: Q: O Debian possui uma política de divulgação de vulnerabilidades?

source: A: Debian has published a vulnerability disclosure policy as part of its participation in the CVE program.
pt_pt: R: O Debian publicou uma política de divulgação de vulnerabilidades como parte de sua participação no programa CVE.

source: Q: Our vulnerability management tool has shown that the following issues are open (list of CVEs with random CVSS scores). When are those going to be fixed?
pt_pt: Q: Nossa ferramenta de gerenciamento de vulnerabilidades mostrou que os seguintes problemas estão abertos (lista de CVEs com pontuações CVSS aleatórias). Quando eles serão corrigidos?

source: A: Debian does not provide CVSS scores and doesn't use CVSS scores from external sources when triaging security issues.
pt_pt: R: Debian não fornece pontuações CVSS e não usa pontuações CVSS de fontes externas na triagem de problemas de segurança.

source: You can check the state of every single CVE ID in the Debian Security Tracker by accessing it by ID.
pt_pt: Você pode verificar o estado de cada ID CVE no Debian Security Tracker acessando-o pela ID.

source: The "Notes" section will contain additional information, e.g. that a security issue doesn't warrant a Debian security update, but might get fixed in a subsequent point release.
pt_pt: A seção "Notas" conterá informações adicionais, por exemplo que um problema de segurança não garante uma atualização de segurança do Debian, mas pode ser corrigido em um lançamento pontual subsequente.

source: A list of packages for which a Security update is planned can be found at the dsa-needed list.
pt_pt: Uma lista de pacotes para os quais uma atualização de segurança está planejada pode ser encontrada em lista necessária para dsa.

source: If you find an error in triage data, you're very welcome to report it. The Debian Security Team will however not generally react to requests asking for more specific information, you should instead contact the vendor of your vulnerability management tool, after all they are the ones who alerted you about a security issue and not Debian.
pt_pt: Se você encontrar um erro nos dados da triagem, sinta-se à vontade para reportá-lo. A equipe de segurança do Debian, no entanto, geralmente não reagirá a pedidos solicitando informações mais específicas. Em vez disso, você deve entrar em contato com o responsável pela sua ferramenta de gerenciamento de vulnerabilidade, afinal foi ele que o alertou sobre um problema de segurança e não o Debian.

source: Deprecated Debian security FAQ
pt_pt: FAQ de segurança Debian descontinuado

source: Q: What does local (remote) mean?
pt_pt: Q: O que significa local (remote)?

source: The field Problem type in DSA mails is not used since April 2014.
pt_pt: O campo Problem type (tipo de problema) nos e-mails DSA não são mais usados desde abril de 2014.

source: A: Some advisories cover vulnerabilities that cannot be identified with the classic scheme of local and remote exploitability. Some vulnerabilities cannot be exploited from remote, i.e. don't correspond to a daemon listening to a network port. If they can be exploited by special files that could be provided via the network while the vulnerable service is not permanently connected with the network, we write local (remote) in such cases.
pt_pt: R: Alguns alertas tratam de vulnerabilidades que não podem ser identificadas usando o esquema clássico de explorações locais ou remotas. Algumas vulnerabilidades não podem ser exploradas remotamente, ou seja, não correspondem a um daemon associado a uma porta de rede. Nos casos em que é possível explorá-las através de arquivos especiais que possam estar disponíveis via rede enquanto o serviço vulnerável não se encontra conectado permanentemente com a rede, nós utilizamos local (remote).

source: Such vulnerabilities are somewhat between local and remote vulnerabilities and often cover archives that could be provided through the network, e.g. as mail attachment or from a download page.
pt_pt: Essas vulnerabilidades estão entre as vulnerabilidades locais e remotas, e muitas vezes dizem respeito a arquivos que poderiam ser disponibilizados através da rede, como um anexo de e-mail ou por uma página de download.

source: dansk Deutsch español français Italiano Nederlands 日本語 (Nihongo) polski Português Русский (Russkij) suomi svenska 中文(简) 中文(HK) 中文(繁)
pt_pt: dansk Deutsch English español français Italiano Nederlands 日本語 (Nihongo) polski Русский (Russkij) suomi svenska 中文(简) 中文(HK) 中文(繁)

source: Last Modified: Fri, Oct 6 21:55:11 UTC 2023 Last Built: Tue, Aug 6 19:49:36 UTC 2024
pt_pt: Última Modificação: Seg, 8 de Abr de 2024, 18:44:21 UTC Última compilação: Ter, 6 de Ago de 2024, 22:08:52 UTC

source: Debian Website in different Languages
pt_pt: Site web do Debian em diferentes idiomas

source: · Content Negotiation
pt_pt: · Negociação de conteúdo

source: · How to set a Web Browser's Language
pt_pt: · Como definir o idioma de um navegador web

source: · How to override the Settings
pt_pt: · Como substituir as configurações

source: · Troubleshooting
pt_pt: · Solução de problemas

source: Content Negotiation
pt_pt: Negociação de conteúdo

source: A team of translators works on the Debian website to convert it for a growing number of different languages.
pt_pt: Uma equipe de tradutores(as) trabalha no site do Debian para convertê-lo para um número crescente de idiomas diferentes.

source: But how does the language switch in the web browser work?
pt_pt: Mas como funciona a mudança de idioma no navegador web?

source: A standard called content negotiation allows users to set their preferred language(s) for web content.
pt_pt: Um padrão chamado negociação de conteúdo permite que os(as) usuários(as) definam seus idiomas preferidos para o conteúdo da web.

source: The version they see is negotiated between the web browser and the web server: the browser sends the preferences to the server, and the server then decides which version to deliver (based on the users' preferences and the available versions).
pt_pt: A versão que eles(as) veem é negociada entre o navegador web e o servidor web: o navegador envia as preferências ao servidor, e o servidor então decide qual versão entregar (com base nas preferências dos(as) usuários(as) e nas versões disponíveis).

source: Read more at W3C
pt_pt: Leia mais na W3C

source: Not everyone knows about content negotiation, so links at the bottom of every Debian page point to other available versions.
pt_pt: Nem todo mundo sabe sobre negociação de conteúdo, então os links na parte inferior de cada página do Debian apontam para outras versões disponíveis.

source: Please note that selecting a different language from this list will only affect the current page.
pt_pt: Por favor observe que a seleção de um idioma diferente nesta lista afetará apenas a página atual.

source: It doesn't change the default language of your web browser.
pt_pt: Isso não altera o idioma padrão do seu navegador web.

source: If you follow another link to a different page, you will see it in the default language again.
pt_pt: Se você seguir outro link para uma página diferente, você o verá no idioma padrão novamente.

source: In order to change your default language, you have two options:
pt_pt: Para alterar o idioma padrão, você tem duas opções:

source: · Configure your web browser
pt_pt: · Configure seu navegador web

source: · Override your browser's language preferences
pt_pt: · Substitua as preferências de idioma do seu navegador

source: Jump straight to the configuration instructions for these web browsers:
pt_pt: Vá direto para as instruções de configuração para estes navegadores web:

source: The original language of the Debian website is English.
pt_pt: O idioma original do site do Debian é o inglês.

source: Therefore, it's a good idea to add English (en) at the bottom of your language list.
pt_pt: Portanto, é uma boa idéia adicionar inglês (en) no final da sua lista de idiomas.

source: This works as a backup in case a page hasn't yet been translated into any of your preferred languages.
pt_pt: Isso funciona como um backup caso uma página ainda não tenha sido traduzida para qualquer um dos seus idiomas preferidos.

source: How to set a Web Browser's Language
pt_pt: Como definir o idioma de um navegador web

source: Before we describe how to configure the language settings in different web browsers, some general remarks.
pt_pt: Antes de descrevermos como definir as configurações de idioma em diferentes navegadores web, algumas observações gerais.

source: Firstly, it's a good idea to include all languages you speak to your list of preferred languages.
pt_pt: Em primeiro lugar, é uma boa ideia incluir todos os idiomas que você fala em sua lista de idiomas preferidos.

source: For example, if you're a native French speaker, you can choose fr as your first language, followed by English with the language code en.
pt_pt: Por exemplo, se você é um falante nativo do francês, pode escolher fr como seu primeiro idioma, seguido por inglês com o código de idioma en.

source: Secondly, in some browsers you can enter language codes instead of choosing from a menu.
pt_pt: Em segundo lugar, em alguns navegadores você pode inserir códigos de idioma em vez de escolher em um menu.

source: If that's the case, keep in mind that creating a list like fr, en doesn't define your preference.
pt_pt: Se for esse o caso, lembre-se de que criar uma lista como fr, en não define sua preferência.

source: Instead, it will define equally ranked options, and the web server can decide to ignore the order and just pick one of the languages.
pt_pt: Em vez disso, ele definirá opções igualmente classificadas, e o servidor web pode decidir ignorar a ordem e escolher apenas um dos idiomas.

source: If you want to specify a real preference, you have to work with so-called quality values, i.e. floating point values between 0 and 1.
pt_pt: Se você deseja especificar uma preferência real, deve trabalhar com os chamados valores de qualidade, ou seja, valores de ponto flutuante entre 0 e 1.

source: A higher value indicates a higher priority.
pt_pt: Um valor mais alto indica uma prioridade mais alta.

source: If we go back to the example with French and English language, you can modify the above example like this:
pt_pt: Se voltarmos ao exemplo com os idiomas francês e inglês, você pode modificar o exemplo acima assim:

source: Be careful with Country Codes
pt_pt: Tenha cuidado com os códigos de país

source: A web server which receives a request for a document with the preferred language en-GB, fr does not always serve the English version before the French one.
pt_pt: Um servidor web que recebe uma solicitação de documento com o idioma preferido en-GB, fr nem sempre serve a versão em inglês antes da francesa.

source: It will only do so if a page with the language extension en-gb exists.
pt_pt: Isso só acontecerá se houver uma página com a extensão de idioma en-gb.

source: It does work the other way around, though: a server can return a en-us page if just en is included in the preferred languages list.
pt_pt: Mas funciona ao contrário: um servidor pode retornar uma página en-us se apenas en estiver incluído na lista de idiomas preferidos.

source: We therefore recommend not to add two-letter country codes like en-GB or en-US, unless you have a very good reason.
pt_pt: Portanto, recomendamos não adicionar códigos de país de dois campos, como en-GB ou en-US, a menos que você tenha um bom motivo.

source: If you do add one, make sure to include the language code without the extension as well: en-GB, en, fr
pt_pt: Se você adicionar um código de dois campos, certifique-se de incluir o código do idioma sem a extensão também: en-GB, en, fr.

source: More about Content Negotiation
pt_pt: Mais sobre negociação de conteúdo

source: Instructions for different Web Browsers
pt_pt: Instruções para diferentes navegadores web

source: We've compiled a list of popular web browsers and some instructions on how to change the preferred language for web content in their settings:
pt_pt: Compilamos uma lista de navegadores web populares e algumas instruções sobre como alterar o idioma preferido para o conteúdo web em suas configurações:

source: At the top right, open the menu and click Settings -> Advanced -> Languages.
pt_pt: No canto superior direito, abra o menu e clique Configurações -> Avançado -> Idiomas.

source: Open the Language menu to see a list of languages.
pt_pt: Abra o menu Idioma para ver a lista de idiomas.
